In [12]:
import sqlite3
import pandas as pd

In [2]:
query ="""
    create table test(a varchar2(10), b  varchar2(20), c real, d integer);
    """

In [5]:
con=sqlite3.connect('mydata1.sqlite')
con.execute(query)

In [6]:
con.commit()

In [7]:
data=[('atlanta','georgia',1.25,6),
     ('Tallahasssee','florida',2.6,3)]
stmt="insert into test values(?,?,?,?)"
con.executemany(stmt,data)

In [8]:
con.commit()

In [9]:
cursor=con.execute('select * from test')
rows=cursor.fetchall()
rows

[('atlanta', 'georgia', 1.25, 6), ('Tallahasssee', 'florida', 2.6, 3)]

In [10]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [13]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

              a        b     c  d
0       atlanta  georgia  1.25  6
1  Tallahasssee  florida  2.60  3

In [15]:
import sqlalchemy as sqla

In [16]:
db=sqla.create_engine('sqlite:///mydata1.sqlite')

In [18]:
pd.read_sql("select* from test",db)

              a        b     c  d
0       atlanta  georgia  1.25  6
1  Tallahasssee  florida  2.60  3